## Terraform Plan Output
```
digitalocean_spaces_bucket.aphiria_com_infrastructure: Refreshing state... [id=aphiria-com-infrastructure]
module.kubernetes.digitalocean_kubernetes_cluster.aphiria_com_cluster: Refreshing state... [id=c0bc903e-71c8-421d-8bce-0a2092731e0f]
module.networking.digitalocean_domain.default: Refreshing state... [id=aphiria.com]
module.monitoring.digitalocean_uptime_check.api: Refreshing state... [id=d4daa623-1532-4113-b1ef-0cf9ab308a79]
module.monitoring.digitalocean_uptime_check.web: Refreshing state... [id=f14cf1b0-0af3-445e-95e5-048571bcd563]
module.networking.digitalocean_record.www_cname: Refreshing state... [id=1744933304]
module.networking.digitalocean_record.ns_2: Refreshing state... [id=1744933311]
module.networking.digitalocean_record.mx_1: Refreshing state... [id=1744933310]
module.networking.digitalocean_record.api_a: Refreshing state... [id=1744933306]
module.networking.digitalocean_record.a: Refreshing state... [id=1744933307]
module.networking.digitalocean_record.mx_4: Refreshing state... [id=1744933302]
module.networking.digitalocean_record.mx_default: Refreshing state... [id=1744933308]
module.networking.digitalocean_record.mx_2: Refreshing state... [id=1744933305]
module.networking.digitalocean_record.ns_3: Refreshing state... [id=1744933312]
module.networking.digitalocean_record.mx_3: Refreshing state... [id=1744933309]
module.networking.digitalocean_record.ns_1: Refreshing state... [id=1744933303]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.kubernetes.digitalocean_kubernetes_cluster.aphiria_com_cluster will be updated in-place
  ~ resource "digitalocean_kubernetes_cluster" "aphiria_com_cluster" {
        id                               = "c0bc903e-71c8-421d-8bce-0a2092731e0f"
        name                             = "aphiria-com-cluster"
        tags                             = []
      ~ version                          = "1.31.1-do.3" -> "1.31.1-do.5"
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.networking.data.kubernetes_service.load_balancer will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service" "load_balancer" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-gateway-nginx-gateway-fabric"
          + namespace        = "nginx-gateway"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.networking.digitalocean_record.a will be updated in-place
  ~ resource "digitalocean_record" "a" {
        id       = "1744933307"
        name     = "@"
      ~ value    = "159.203.150.100" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.networking.digitalocean_record.api_a will be updated in-place
  ~ resource "digitalocean_record" "api_a" {
        id       = "1744933306"
        name     = "api"
      ~ value    = "159.203.150.100" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```